INSERT INTO `user` (created_at, email, name, password)
VALUES (NOW(), 'abcd22@gmail.com', '관리자',
        '$40801$9inMVXWXWsfnQQN0CQL47IBjXzekALravLMstQzNjjC4wkJBvzuHg/sQlPaAkCos6kf22i/jqHJdP/kc5NFFqw==$EGOhVYDqUUPlzA76PLi/bUsPLqyvlqwwWY0UcIUR/MI=');

INSERT INTO `post` (`id`, `content`, `reg_date`, `title`, `user_id`)
VALUES (1,
        '대한민국의 개 품종. 원산지는 이름에서 알 수 있듯이 전라남도 진도군이다.\n\n천연기념물 제 53호지만, 모든 진돗개가 전부 다 천연기념물로 지정이 되는 것이 아니라, 진도군 내에서 심사를 받아 통과되면 진도개라는 이름으로 천연기념물로서 보호를 받게 된다. 삽살개, 풍산개, 동경이 등과 함께 한국 고유의 품종. 진도개는 국가에서 직접 관리하는 품종으로 진도개 사업소를 운영하며, 이 곳에서 심사에 통과된 진도개들의 혈액샘플이 보관된다. 진도개처럼 국가에서 직접 개의 품종을 관리하는 경우는 매우 드문 일이라고 한다.\n\n표준어는 진돗개[3]이나 천연기념물 상에서는 진도개로 등록되어 있는데, 이는 원산지인 진도를 분명히 드러내야 한다는 진도 지역의 의견을 문화재청이 수용하여 심사를 통과한 진도군의 진돗개에 한해서만 진도개라는 명칭을 사용하기로 한 것이다. 여담으로 일반 진돗개도 동물 등록증에는 진도견으로 표기하기도 한다.',
        '2024-03-22 14:14:29.000000', '진돗개는 참말로 귀여워', 1),
       (2,
        '파이썬은 1991년에 귀도 반 로섬(Guido van Rossum)에 의해 만들어진 인터프리터 프로그래밍 언어이다. 직관적이고 쉬우며 특징과 다양하고 풍부한 라이브러리들을 바탕으로 한 강력한 생태계를 가지고 있어 프로그래밍 교육, 인공지능, 데이터 분석 및 빅데이터, 백엔드, 프론트엔드, 웹 스크래핑 등 다양한 분야에서 사용되며, 이에 힘입어 2023 TIOBE 인덱스 기준 프로그래밍 언어 순위 1위이기도 하다.\n\n파이썬 서문에 따르면 파이썬은 1989년 크리스마스에, 귀도가 취미 프로젝트로 시작하였다. ''Python''이라는 이름은 귀도가 즐겨 보던 영국의 6인조 코미디 그룹 몬티 파이썬에서 이름을 따왔다.\n\n실행할 수 있는 의사 코드(Executable pseudocode)라고 불릴 정도로 문법이 단순하며 매우 미려하다. 때문에 초보자들이 프로그래밍을 할 때 많이 추천하는 언어이기도 하다. 그럼에도 사용률과 생산성, 실무에서의 사용성도 높기에 실무에서도 활발하게 사용되고 있다. 이는 APL이나 BASIC과 같은 교육용으로 사용되는 다른 언어들과의 차별점이기도 하다.',
        '2024-03-22 14:11:03.000000', '파이썬에 대해 정리했습니다.', 1),
       (3,
        '1995년에 발표된 오픈 소스 RDBMS. ''마이에스큐엘''이라고 읽는다. ''SQL'' 부분을 ''스큐엘''로 읽는게 공식인[1] PostgreSQL과는 달리 MySQL은 SQL을 ''에스큐엘''로 끊어서 읽는게 공식으로 정해진 발음이다. 상징 동물은 돌고래이다.\n\n최초 제작사는 스웨덴의 MySQL AB였는데, 2008년에 썬 마이크로시스템즈에게 10억 달러에 인수되었고, 이후 2010년에 오라클이 썬을 72억 달러에 인수하면서 같이 넘어갔다. 따라서 MySQL의 소유주는 오라클이다. 그런데 오라클은 자체 상용 RDBMS인 오라클 데이터베이스를 가지고 있고, 오픈 소스에 대해 호의적이지 않은데다 프로그램이 갈수록 복잡해지고 있어서 MySQL 사용자들 사이에서도 불안감이 커지고 있다.\n\n그래서 오픈 소스 진영에서 MySQL을 모태로 MariaDB라는 RDBMS를 만들었다. 현재 대부분의 리눅스 배포판 들은 MySQL과 MariaDB를 둘 다 기본적으로 지원하고 있다.',
        '2024-03-22 14:12:14.000000', 'MySQL 개요', 1),
       (4,
        '일본의 토프레(Topre) 사의 키보드 및 마우스 브랜드.\n\n해피해킹과 더불어 입이 떡 벌어질 정도로 비싸기로 유명한 무접점 키보드 브랜드로[1], 일본의 기계 공구 전문 제조업체 토프레 사에서 생산하고 있다.\n\n회사 이름의 유래는 Tokyo Press이며, 키보드 이름의 유래는 말 그대로 (기계식 키보드와 달리) 키보드를 누르는 힘을 정확히 잴 수 있다는 의미의 Real Force.\n\n토프레는 키보드 전문 제조사가 아니며 스위치, 베어링, 프레스기 등이 주력이라고 한다. 자체 개발한 정전용량 무접점 스위치 신기술을 적용할 곳을 찾다 보니 키보드를 만들게 됐다는, 조금은 어처구니 없는 경력을 가진 회사.[2] 그렇기에 토프레에게 키보드와 마우스는 부업이라는 말은 사실이다.\n\n토프레 키보드는 1983년부터 생산되어 원래는 은행의 업무용으로 등으로 납품되다 입소문을 타고 2001년부터는 일반인에도 ''리얼포스''라는 브랜드로 판매가 시작됐지만, 토프레가 원래 키보드 만드는 회사가 아니다 보니 마케팅에 신경 쓰지 않아서 극히 일부의 사람만 아는 물건이었다. 프로그래머들에게는 2003년부터 같은 스위치를 사용하는 해피 해킹 프로페셔널이 훨씬 유명했다.\n\n리얼포스가 지금 같은 유명세를 얻은 것은 한국의 요청으로 텐키리스 모델인 리얼포스 86을 제조하면서부터. 리얼포스 86은 IBM SpaceSaver2 이후 근 20년만에 발매된 텐키리스 모델[3]이라는 점과, 극강의 키감으로 소문난 해피 해킹 프로페셔널과 동일한 스위치가 들어있다는 점에서 방향 키를 쓸 일이 많은 전 세계의 윈도우 기반 프로그래머들에게 엄청난 주목을 끌었다. 하지만 한국의 주문으로 만들어진 커스텀 모델이라는 점 때문에 본가인 일본에서도 구할 수가 없어서 많은 이들을 좌절시켰다.\n\n이 수요를 확인한 토프레는 다음 해 86에 오른쪽 윈도우 키를 추가, 키캡 내장 LED, Scroll Lock키로 Num Lock를 제어하도록 변경한 87 모델을 내놓고 101 모델 외 윈도우 키와 메뉴 키를 추가한 라인업을 내놓기 시작했다. 그리고 텐키리스 모델의 수요를 확인한 다른 기계식 키보드 제작사들도 본격적으로 텐키리스 모델을 내놓기 시작하면서 키보드의 선택폭이 다양해졌다.\n\n2022년 기준으로 국내에는 거의 수입이 안되고 있어 신제품 보기가 어렵다. 수입사 홈페이지를 가봐도 거의 1년내내 모든 모델이 품절 상태이며, 인터넷 커뮤니티 등을 뒤져봐도 신제품을 구입했다는 후기 자체가 없다. 상태 좋은 중고물건이 올라오면 순식간에 구매자들이 달라붙는다. 2022년 1월에 R2모델 일부가 재입고되었는데, 2~3일 사이에 전부 품절되었다. 리얼포스 키보드의 인기와 수요가 여전하다는 것을 입증하였다.',
        '2024-03-22 14:13:05.000000', '리얼포스 키보드 사고싶어요', 1),
       (5,
        '자바스크립트로 개발된 컴포넌트 구조 기반 프론트엔드 프레임워크. 보통 뷰라고 부른다.[1]\n2. 예시[편집]\n이러한 HTML 파일이 있다고 가정했을 때,\n<div id=\"app\">\n  안녕, {{ name }}!\n</div>\n\n해당 코드를 실행시키면,\nVue.createApp({\n  data() {\n    return {\n      name: ''나무위키''\n    }\n  }\n}).mount(''#app'')\n\n\"안녕, 나무위키!\" 가 출력된다.',
        '2024-03-22 14:13:47.000000', 'Vue.js 기본코드', 1),
       (6,
        '서버(server)는 클라이언트에게 네트워크를 통해 서비스하는 컴퓨터를 의미한다. 이름 그대로 번역해서 ''제공자''라고 하면 와닿을 것이다. 인터넷 하면 중앙에서 관리해주는 메인프레임으로 오해받기도 하나, 개인용 단말기 근처에서의 연결이 그렇고[2], 실제 인터넷은 수많은 서버, 라우터 등이 거미줄처럼 얽혀서 형성된 것이다. 홈페이지를 운영하려면 직간접적으로 서버가 필요하며, 온라인 게임이나 웹게임들도 서버를 통해서 서비스를 하고 있다. 보통 어느 정도 규모가 있는 기관에서는 데이터베이스, 웹 어플리케이션 서버 등에 방화벽, 라우터 등이 붙어 네트워크를 형성한다.',
        '2024-03-22 14:14:29.000000', '서버란 무엇일까?', 1),
       (7,
        '로드 존슨(Rod Johnson)이 2002년에 출판한 저서 Expert One-on-One J2EE Design and Development에서 선보인 소스 코드를 시작으로 점점 발전하게 되었다. 2003년 6월에 최초로 공개되었다. 2023년 9월 기준 최신 버전은 6.0.11. 스프링 프레임워크 프로젝트를 간편하게 설정할 수 있도록 도와주는 서브 프로젝트 스프링부트가 있으며, 현재는 스프링 부트 위주로 기능이 추가되고 있다.\n\n''스프링''이라는 이름의 유래는 이전에 Java EE(엔터프라이즈 에디션)의 스펙을 구현한 EJB가 기술의 복잡도가 증가해서 성능이 느렸던 것을 탈피하여, EJB 시절을 \"겨울\"에 빗대어 겨울 후의 \"봄\"으로 새로운 시작한다는 것을 의미하는 스프링(봄)이 되었다. 그러나 아직 춥다 Java Virtual Machine에서 작동하며, 아파치 라이선스 2.0을 따르는 오픈 소스 프레임워크이다.\n\n한국 전자정부표준프레임워크의 기반 기술이며 한국정보화진흥원에서는 공공기관의 웹 서비스 제공 시 스프링을 권장하고 있다.\n\n이게 무슨 소리인가 싶은 사람들을 위해 간단하게 설명하자면 군대로 비유할때 위에서 명령을 내리는 지휘관보다 인사장교/행정보급관처럼 사이드에서 기준을 마련하고 필요한 컴포넌트를 상하관계 없이도 중재해서 가져다주는 프레임워크라고 간주하면 된다. 그래서 용어도 어드바이스(조언)라는 용어를 사용한다.\n\n여러가지 문제점을 해결하기 위한 디자인 패턴, 아키택처가 적용되어 있어서 어려운 용어가 많이 사용되는 프레임워크인데, 책을 보고 이론을 공부하기보다는 \"스프링으로 게시판 만들기\" 따위의 예제를 병행하면서 공부하는게 더 이해가 잘 된다.\n\nSpring에서 공식 제공하는 이클립스 기반의 IDE인 Spring Tools 를 제공 중이며, Visual Studio Code 버전으로도 제공하고 있다. 또한 JetBrains의 IntelliJ IDEA도 Spring 프레임워크를 훌륭하게 지원하는 IDE이다.',
        '2024-03-22 14:10:24.000000', '스프링 프레임워크에 관하여', 1);

ALTER TABLE `post` ALTER COLUMN id RESTART WITH (SELECT MAX(id) + 1 FROM `post`);
